<font color="red">hello

<font size="5"><font color="red">now lets work on fillna interpolate and dropna techniques

In [13]:
import pandas as pd
details = pd.DataFrame({"names":["vishnu"," ","mohan","bharath"],
                       "ages":[20," " ,31,29]})

In [16]:
with pd.ExcelWriter("D:\\data science\\pandas\\csv\\pandas3.xlsx") as writer:
    details.to_excel(writer,sheet_name="sheet1",index=False)

In [23]:
df = pd.read_excel("D:\\data science\\pandas\\csv\\pandas3.xlsx",na_values={"names":" ","ages":" "})
df

     names  ages
0   vishnu  20.0
1      NaN   NaN
2    mohan  31.0
3  bharath  29.0

In [24]:
df.fillna(0)

     names  ages
0   vishnu  20.0
1        0   0.0
2    mohan  31.0
3  bharath  29.0

<font size="5"><font color="red">we can specify specific rows of columns by using dictionary in fillna

In [28]:
new_df=df.fillna({"names":"not avail",
          "ages":0})
new_df

       names  ages
0     vishnu  20.0
1  not avail   0.0
2      mohan  31.0
3    bharath  29.0

In [29]:
df

     names  ages
0   vishnu  20.0
1      NaN   NaN
2    mohan  31.0
3  bharath  29.0

<font size="5"><font color="red">here i am copying my df into new_df to not change my original df

In [30]:
new_df = df.fillna(method="ffill")
new_df

     names  ages
0   vishnu  20.0
1   vishnu  20.0
2    mohan  31.0
3  bharath  29.0

<font size="5"><font color="red">we can pass a paramter metho with string ffill and bfill to fill nan values with previous ornext values

In [31]:
new_df = df.fillna(method="bfill")
new_df

     names  ages
0   vishnu  20.0
1    mohan  31.0
2    mohan  31.0
3  bharath  29.0

<font size="5">we can use another parameter to set our limit for fillna method

In [32]:
new_df = df.fillna(method="ffill",limit=1)
new_df

     names  ages
0   vishnu  20.0
1   vishnu  20.0
2    mohan  31.0
3  bharath  29.0

<font size="5"><font color="red">now lets see about interpolate method

In [33]:
new_df = df.interpolate()
new_df

     names  ages
0   vishnu  20.0
1      NaN  25.5
2    mohan  31.0
3  bharath  29.0

<font size="5">lets look at dropna method

In [34]:
new_df = df.dropna()
new_df

     names  ages
0   vishnu  20.0
2    mohan  31.0
3  bharath  29.0

In [35]:
new_df = df.dropna(how="all")
new_df

     names  ages
0   vishnu  20.0
2    mohan  31.0
3  bharath  29.0

In [36]:
new_df = df.dropna(thresh=0)
new_df

     names  ages
0   vishnu  20.0
1      NaN   NaN
2    mohan  31.0
3  bharath  29.0